Revit 2026 API

# ElectricalSystemVoltage Property

---

The Voltage value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Voltage { get; }
```
```vb
Public ReadOnly Property Voltage As Double
	Get
```
```cpp
public:
property double Voltage {
	double get ();
}
```
```fsharp
member Voltage : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the Voltage value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace